tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
brew "bat"
brew "cmake"
brew "doxygen"
brew "exa"
brew "git"
brew "go"
brew "llvm@16"
brew "mongosh"
brew "node@16"
brew "nvm"
brew "postgresql@14", restart_service: true
brew "zsh"
cask "anaconda"
cask "docker"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "notion"
cask "postico"
cask "postman"
cask "rectangle"
cask "spotify"
cask "ticktick"
cask "visual-studio-code"
