tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mongodb/brew"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Platform built on V8 to build network applications
brew "node@16"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Manage multiple Node.js versions
brew "nvm"
# UNIX shell (command interpreter)
brew "zsh"
# Postgres
brew "postgresql@14", restart_service: true
# App to build and share containerized applications and microservices
cask "docker"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to write, plan, collaborate, and get organized
cask "notion"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Open-source code editor
cask "visual-studio-code"
# Google chrome
cask "google-chrome"
# Spotify
cask "spotify"
# Intellij
cask "intellij-idea-ce"
# Postico (postgres)
cask "postico"
# Ticktick
cask "ticktick"
